import random

# 0과 1 사이의 난수 생성
print(random.random())

print('\n1.-----------------------------------------------------')
# 1과 10 사이의 난수 생성
print("\t", random.uniform(1, 10))

print('\n2.-----------------------------------------------------')
# 1부터 10 사이의 정수형 난수 반환
print("\t", random.randint(1, 10))

print('\n3.-----------------------------------------------------')
# 0부터 100 사이 짝수 중 (2증가) 하나 선택
print("\t", random.randrange(0, 100, 2))

print('\n4.-----------------------------------------------------')
print("\t", random.choice('abcdefghij'))

print('\n5.-----------------------------------------------------')
print("\t", random.sample([1,2,3,4,5], 3))

print('\n6.-----------------------------------------------------')
items = [1, 2, 3, 4, 5, 6, 7]
random.shuffle(items)
print("\t", items)